{
  "knowledge_base": "driscoll_warehouse_night_shift_checking_manual",
  "version": "1.0",
  "description": "Warehouse night_shift_checking processes and procedures",
  "source_file": "Night Shift Checking Manual.docx",
  "file_hash": "045be5177ee6f4c4da5293a7a239a5952e9ba1d05229fe23a69e2161ac52edf9",
  "chunks": [
    {
      "id": "warehouse_night_shift_checking_introduction_0",
      "category": "night_shift_checking",
      "section_title": "Introduction",
      "keywords": [
        "shift",
        "checking",
        "night",
        "warehouse",
        "accuracy",
        "order",
        "orders",
        "breaks",
        "product",
        "case"
      ],
      "content": "Night Shift Checking Manual\n\nOverview\n\nChecking during the night shift is a critical part of the warehouse operation. The role ensures that all picked products are accurate, complete, and correctly labeled before being loaded onto trucks. This position directly impacts customer satisfaction and the overall accuracy of orders leaving the warehouse.\n\nNight shift checking typically begins at 4:00 PM or 5:00 PM and concludes when the shift’s work is complete—usually between 3:30 AM and 4:30 AM, depending on nightly volume and performance.\n\nShift Schedule and Breaks\n\nCheckers follow the same schedule as other night shift positions:\n\nTwo 15-minute breaks\n\nOne 30-minute lunch break\n\nBreaks cannot be taken in the machine room or on the warehouse floor.\n\nRole and Responsibilities\n\nThe main responsibility of a checker is to verify every product picked by the warehouse team before it is loaded for delivery. Each order must be reviewed carefully to ensure accuracy and quality control. Steel toe shoes above the ankle or necessary given company policy.\n\nCore duties include:\n\nReceiving order sheets from the clerks at the check window.\n\nReviewing orders pallet by pallet and case by case to verify correctness.\n\nChecking both the physical product and the printed label—not relying solely on labels, since label errors may occur.\n\nEnsuring that each case matches what appears on the printed order list.\n\nMarking any missing, incorrect, or extra items on the sheet.\n\nReporting any discrepancies to the clerks immediately so the issue can be corrected.\n\nAccuracy and Productivity\n\nAs a checker, attention to detail and efficiency go hand in hand.\n\nThe loaders depend on checkers to clear pallets quickly so they can continue loading trucks.\n\nIf checking falls behind, the floor can become congested, which slows down the entire shift.\n\nAccuracy is critical—errors can cause customer dissatisfaction, product returns, or fines, especially with school orders and VIP routes.\n\nOrder Priorities",
      "chunk_token_count": 480
    },
    {
      "id": "warehouse_night_shift_checking_introduction_1",
      "category": "night_shift_checking",
      "section_title": "Introduction",
      "keywords": [
        "orders",
        "customer",
        "checked",
        "night",
        "shift",
        "pallets",
        "any",
        "communication",
        "during",
        "there"
      ],
      "content": "During the night shift, there are two key categories of orders that require special attention:\n\nConnecticut (CT) Routes: These are checked first since they go out earliest in the morning.\n\nVIP Orders: Roughly 130 orders each night, including schools and high-priority customers.\n\nSchool pallets must be checked thoroughly—any wrong or missing case can result in fines or loss of customer trust.\n\nCommunication\n\nEffective communication is essential for success:\n\nNotify clerks immediately of any product errors, shortages, or damaged goods.\n\nCoordinate with loaders to ensure checked pallets are promptly cleared and loaded.\n\nWork closely with pickers and managers to maintain productivity and accuracy across the shift.\n\nImportance of the Role\n\nCheckers are the last line of defense before customer orders leave the warehouse. Mistakes caught here prevent issues at the customer’s door. Being deliberate, precise, and efficient ensures that Driscoll Foods maintains its commitment to quality, reliability, and customer satisfaction.",
      "chunk_token_count": 248
    }
  ]
}