{
  "knowledge_base": "driscoll_warehouse_night_shift_supervisor_manual",
  "version": "1.0",
  "description": "Warehouse night_shift_supervisor processes and procedures",
  "source_file": "Night Shift Supervisor Manual.docx",
  "file_hash": "586d6964e7968aa7dd8b609c358a9ef624bdf2be2fa85763593efb7493b980c6",
  "chunks": [
    {
      "id": "warehouse_night_shift_supervisor_introduction_0",
      "category": "night_shift_supervisor",
      "section_title": "Introduction",
      "keywords": [
        "shift",
        "supervisors",
        "supervisor",
        "team",
        "breaks",
        "night",
        "teams",
        "productivity",
        "ensure",
        "work"
      ],
      "content": "Night Shift Supervisor Manual\n\nOverview\n\nSupervisors are the leaders of the night shift warehouse teams, responsible for maintaining productivity, accuracy, and compliance across all operations. They oversee pickers, checkers, hi-lo operators, and clerks to ensure the shift runs efficiently and safely.\n\nSupervisors typically work the full night shift, starting at 4:00 PM or 5:00 PM and ending when all work is complete (around 4:00 AM).\n\nShift Schedule and Breaks\n\nTwo 15-minute breaks\n\nOne 30-minute lunch break\n\nSupervisors must monitor break times to ensure their team is taking breaks at the correct times and that work coverage is maintained.\n\nFootwear: Steel-toe, above-ankle shoes are required for safety compliance.\n\nRoles and Responsibilities\n\nSupervisors are responsible for managing and guiding their teams. Each supervisor oversees a specific area:\n\nTemperature Zone Supervisors: Each zone (dry, cooler, freezer) has a dedicated supervisor.\n\nPicker/Checker Supervisor: Oversees picking and checking operations across the shift.\n\nCore responsibilities include:\n\nMonitoring team productivity and providing direction if performance falls behind.\n\nCatching mistakes from team members and addressing them according to company policy.\n\nAdministering write-ups, suspensions, or recommending termination in consultation with Kudjoe.\n\nChecking crew attendance and reporting missing or late employees to Kudjoe, noting whether they notified the supervisor or not.\n\nInspecting break rooms, locker rooms, and machine rooms to ensure employees are not taking unauthorized breaks.\n\nHelping team members maintain speed and efficiency by jumping in to assist with tasks such as hi-lo operation or replenishment when needed.\n\nTeam Management and Communication\n\nSupervisors must communicate clearly with their teams about expectations, productivity standards, and safety.\n\nProviding feedback and guidance ensures employees understand how they are performing and what is required to meet shift goals.",
      "chunk_token_count": 479
    },
    {
      "id": "warehouse_night_shift_supervisor_introduction_1",
      "category": "night_shift_supervisor",
      "section_title": "Introduction",
      "keywords": [
        "supervisors",
        "employees",
        "floor",
        "safety",
        "compliance",
        "team",
        "accountable",
        "proper",
        "equipment",
        "success"
      ],
      "content": "Maintaining a visible presence on the floor keeps employees accountable and helps prevent errors or slowdowns.\n\nSafety and Compliance\n\nSupervisors enforce all safety protocols, including proper equipment use, warehouse traffic awareness, and personal protective equipment compliance.\n\nSteel-toe shoes above the ankle are mandatory for all supervisors and strongly encouraged for employees.\n\nSupervisors set the tone for safety culture on the floor and model proper procedures for employees.\n\nImportance of the Role\n\nSupervisors are essential to the success of the night shift. They ensure:\n\nEmployees are productive and accurate\n\nMistakes are caught and corrected immediately\n\nAttendance and break policies are enforced\n\nWorkflow is smooth and the team meets nightly goals\n\nBy keeping the team organized, efficient, and accountable, supervisors directly contribute to the company’s operational success and customer satisfaction.\n\nBest Practices\n\nWalk the floor constantly to observe employee activity.\n\nAddress productivity issues promptly and constructively.\n\nAssist team members when needed to maintain shift speed.\n\nMonitor attendance and break compliance carefully.\n\nCommunicate with Kudjoe regarding staffing, performance issues, and any incidents.",
      "chunk_token_count": 298
    }
  ]
}