{
  "knowledge_base": "driscoll_warehouse_night_shift_clerk_manual",
  "version": "1.0",
  "description": "Warehouse night_shift_clerk processes and procedures",
  "source_file": "Night Shift Clerk Manual.docx",
  "file_hash": "295ce3bf83869a0adc2ea448ad2a99c9b80b1bff51a76dc606a37330cb91a895",
  "chunks": [
    {
      "id": "warehouse_night_shift_clerk_introduction_0",
      "category": "night_shift_clerk",
      "section_title": "Introduction",
      "keywords": [
        "shift",
        "clerk",
        "clerks",
        "night",
        "labels",
        "weight",
        "pickers",
        "entry",
        "workflow",
        "orders"
      ],
      "content": "Night Shift Clerk Manual\n\nOverview\n\nClerks during the night shift are the central coordinators of warehouse operations. They manage label distribution, weight entry, shorts handling, and workflow tracking, ensuring pickers, loaders, and hi-lo operators can perform their tasks efficiently. The clerks’ performance directly impacts the productivity and accuracy of the entire night shift.\n\nNight shift clerks typically work from 4:00 PM or 5:00 PM until the end of the shift (around 4:00 AM). One clerk starts at 3:00 PM to prepare labels and have the system ready for the start of picking.\n\nShift Schedule and Breaks\n\nClerks follow the standard night shift breaks with slight adjustments:\n\nTwo 15-minute breaks\n\nOne 30-minute lunch break\n\nBreak times are staggered to ensure that at least three clerks are always at the window, keeping operations from falling behind.\n\nRoles and Responsibilities\n\nThe night clerk team is divided into specialized roles that ensure smooth workflow:\n\nWeight Entry Clerk (Jessica’s Role)\n\nInputs weights reported by pickers into Telnet.\n\nAccurate weight entry is critical because product weight determines billing.\n\nErrors in weight input can result in incorrect sales and revenue loss.\n\nCoordinates with pickers to verify weights and ensure system accuracy.\n\nDistribution Clerk Order\n\nPrint labels and distribute orders to pickers.\n\nResponsible for maintaining shift timing by ensuring all pickers receive their orders efficiently.\n\nMemorize picker IDs to speed up data entry.\n\nConnect picker IDs to APT for real-time tracking of each pick and productivity measurement\n\nEnsures that labels are scanned and tracked properly.\n\nLabel Preparation Clerk\n\nPrints labels and splits them pallet by pallet for distribution.\n\nEnsures labels match correct orders to prevent mis-picks or shorted orders.\n\nMaintains organization so other clerks can distribute labels accurately.\n\nWorkflow Tracking Clerk\n\nMonitors shift progress and updates spreadsheet reports to track workflow.\n\nKeeps the shift on pace by communicating with other clerks and coordinating tasks.",
      "chunk_token_count": 495
    },
    {
      "id": "warehouse_night_shift_clerk_introduction_1",
      "category": "night_shift_clerk",
      "section_title": "Introduction",
      "keywords": [
        "clerks",
        "ensure",
        "maintain",
        "shift",
        "efficiency",
        "pickers",
        "operators",
        "without",
        "delays",
        "workflow"
      ],
      "content": "Ensure pickers, hi-lo operators, and loaders can perform without delays.\n\nWorkflow and Coordination\n\nThree clerks must always be present at the window to maintain operations.\n\nClerks constantly communicate with pickers and hi-lo operators to handle short items.\n\nRegularly update and verify system data to ensure accuracy of inventory, weights, and order fulfillment.\n\nLabel management is crucial—printing, splitting, and distributing labels correctly keeps the shift flowing.\n\nImportance of the Role\n\nClerks are the drivers of the warehouse operation during the night shift. Their efficiency and accuracy directly influence:\n\nPicker productivity\n\nLoader efficiency\n\nHi-Lo operator performance\n\nAccurate inventory and order fulfillment\n\nCustomer satisfaction and correct deliveries\n\nWithout properly coordinated clerks, the night shift can quickly fall behind, causing cascading delays for every role on the floor.\n\nBest Practices\n\nStagger breaks to always maintain at least three clerks at the window.\n\nDouble-check label strings before distributing to ensure orders are complete.\n\nCommunicate immediately about shorts or missing items.\n\nMaintain organized spreadsheets and real-time tracking of workflow.\n\nMemorize picker IDs and routes for efficiency.\n\nVerify weight entries carefully in Telnet for accurate billing.",
      "chunk_token_count": 311
    }
  ]
}