{
  "knowledge_base": "driscoll_warehouse_driver_check-in_manual",
  "version": "1.0",
  "description": "Warehouse driver_checkin processes and procedures",
  "source_file": "Driver Check-in Manual.docx",
  "file_hash": "645c3eb7a2f173ad92706b09317fd557b8bf2a48e7fd8723a523af0cb3679105",
  "chunks": [
    {
      "id": "warehouse_driver_checkin_introduction_0",
      "category": "driver_checkin",
      "section_title": "Introduction",
      "keywords": [
        "driver",
        "return",
        "returned",
        "drivers",
        "product",
        "form",
        "returns",
        "check",
        "correct",
        "truck"
      ],
      "content": "Driver Check-In Manual\n\nOverview\n\nDriver Check-In is responsible for ensuring all documentation, returned products, and equipment from drivers are properly collected, verified, organized, and routed to the correct departments. This team is essential for end-of-day accountability, inventory accuracy, product quality control, and clear communication across the company.\n\nCore Responsibilities\n\nBring every truck in as drivers return.\n\nEnsure drivers clean the backs of their trucks.\n\nRemove and organize pallets from each truck.\n\nCollect all paperwork, including invoices and Driver Return Forms.\n\nVerify all returned cases and confirm that the driver’s stated reason is correct\n\nSort all returned items into the correct zones (refused, meat/produce/eggs/chicken, vendor returns)\n\nTrack which trucks are back, and which remain on the road.\n\nDeliver invoices to Invoice Cleaning once a cart is filled.\n\nEnsure pallets are organized into uniform stacks (ideally 13 high) for night shift use.\n\nEnsure straps and blankets are placed into their proper containers for loaders.\n\nStay on duty until transportation clears all remaining drivers.\n\nDriver Return Forms\n\nAll drivers return two key documents:\n\nTheir invoice packet (white & yellow sheets for each stop).\n\nDriver Return Form.\n\nPotential Pick Up form\n\nDriver Return Form fields:\n\nDriver name\n\nRoute number\n\nHelper name (if applicable)\n\nStraps and blanket count\n\nSignature\n\nReturned cases section (customer, order #, item description, item #, reason code)\n\nColor coding:\n\n• School drivers → Green driver return form\n\n• All others → White driver return form\n\nReturn Reason Codes\n\n1 – Mispick\n\n2 – Short on Load\n\n3 – Short / Found on Truck\n\n4 – Sales Error\n\n5 – Product Quality / Temperature Issue\n\n6 – Product / Case Damaged\n\n7 – NYC DOE Refused (Schools only)\n\n8 – Product Over\n\nReturned Product Processing\n\nDriver Check-In verifies each returned case and organizes as follows:\n\nBehind the team: All refused cases\n\nLeft side: Meat, poultry, fish, eggs, produce returns\n\nFront area: Vendor returns and customer pickups\n\nVendor returns are later moved to Receiving.",
      "chunk_token_count": 484
    },
    {
      "id": "warehouse_driver_checkin_introduction_1",
      "category": "driver_checkin",
      "section_title": "Introduction",
      "keywords": [
        "invoice",
        "cases",
        "customer",
        "report",
        "driver",
        "check",
        "confirms",
        "transportation",
        "cleaning",
        "team"
      ],
      "content": "Refused/damaged/expired cases cannot be returned to inventory and must be documented accurately.\n\nCustomer Pick-Up Report\n\nDriver Check-In must review and mark off the Customer Pick-Up Report daily. This report lists all cases scheduled to be picked up from customers. Checking off each pickup confirms the request was fulfilled, ensuring the rest of the company, especially Sales, Transportation, and Invoice Cleaning knows that the customer’s needs were completed accurately.\n\nThis step is critical because:\n\nIt prevents missed credits.\n\nConfirms customer satisfaction.\n\nEnsures returned product is properly routed.\n\nMaintains accurate inventory and financial records.\n\nInvoice Collection & Delivery\n\nEach truck’s invoice count must match the number of scheduled stops. Once verified, invoices are placed in a rolling cart. When full, the cart is delivered to Invoice Cleaning so that credits, adjustments, and billing can be finalized.\n\nEnd-of-Day Protocol\n\nTwo Driver Check-In team members remain on duty until transportation confirms whether remaining drivers have cases returning. If drivers have returns, the team must remain until those cases are processed and placed appropriately. If not, transportation instructs those drivers to submit invoices directly to Invoice Cleaning, allowing the Driver Check-In team to close out.\n\nAll pallets, equipment, and paperwork must be organized and accounted for before departure.",
      "chunk_token_count": 344
    }
  ]
}