{
  "knowledge_base": "driscoll_warehouse_hr_manual",
  "version": "1.0",
  "description": "Warehouse hr processes and procedures",
  "source_file": "HR Manual.docx",
  "file_hash": "8cda4324a90300f20ffca1712d9b5089c4deb6ad96fc5f21e9905b322a9c22f3",
  "chunks": [
    {
      "id": "warehouse_hr_introduction_0",
      "category": "hr",
      "section_title": "Introduction",
      "keywords": [
        "payroll",
        "employees",
        "employee",
        "incentives",
        "department",
        "samantha",
        "team",
        "members",
        "communication",
        "paychex"
      ],
      "content": "Human Resources Department Manual\n\nOverview\n\nHR at Driscoll Foods is led by Samantha Giordano and consists of four team members\n\nThe department handles payroll, employee complaints, hiring, injuries, compliance, and all personnel documentation.\n\nNeutrality, confidentiality, and professionalism are always essential.\n\nA lot of the job is unanticipated and spontaneous.\n\nTeam Structure\n\nSamantha Giordano – HR Lead overseeing payroll, incentives, investigations, interviews, injuries, compliance, and invoice cleaning.\n\nTeam Members (4) – Support with tracking, reporting, onboarding, filing, and communication across Operations and other departments.\n\nPayroll & Incentives\n\nMondays: major payroll and timecard review day.\n\nOnly certain HR members have access to timecards, PTO, sick days, and incentive logs.\n\nDriscoll employees can be verified in Paychex; Stonehill agency hires require manual entry.\n\nTuesday: incentives must be completed by noon.\n\nFridays: high volume of payroll questions from employees.\n\nHR updates spreadsheets for incentives, bonuses, hourly pay, and corrections.\n\nEmployee Communication\n\nHR must speak clearly and patiently with employees.\n\nSamantha asks many clarifying questions to understand issues fully.\n\nExplanations must be simple and easy for all employees to understand.\n\nHR prioritizes poise, patience, and accuracy in communication.\n\nAttendance Tracking & Write‑Ups\n\nNayeli reviews the Night Shift Recap from Kudjoe every morning.\n\nTracks absences, reasons, and notes if employees are in their first 90 days using Paychex.\n\nReviews Dispatch Sheet from Delareese for absent drivers\n\nUpdates the Ops Attendance Tracker with offense numbers.\n\nMaintains the Write-Up Tracker and uploads related documents to employee Paychex files.\n\nDocumentation & Records\n\nHR maintains individual employee folders with onboarding documents, write-ups, agreements, and reports.\n\nJob applications are received through Indeed.\n\nNon-operations applications are forwarded to Sam Cuesta to pass to department heads.",
      "chunk_token_count": 477
    },
    {
      "id": "warehouse_hr_introduction_1",
      "category": "hr",
      "section_title": "Introduction",
      "keywords": [
        "injuries",
        "loan",
        "employees",
        "days",
        "workers",
        "labor",
        "thursday",
        "checks",
        "documentation",
        "bereavement"
      ],
      "content": "HR depends on documentation from Transportation and Ops to complete reports and verification processes.\n\nBereavement & Loan Policy\n\nPaid bereavement leave applies to parents, in-laws, siblings, and grandparents.\n\nLoan repayment agreements are tracked; employees who quit must repay within 7 days\n\nLoan requests are assessed using hire date, balance owed, attendance, and write-up history.\n\nInjury Handling & Workers Compensation\n\nAll injuries must be reported immediately.\n\nHR completes an injury report and confirms if the employee wants medical attention (Concentra or CityMD).\n\nWorkers Comp insurance is through Sentry.\n\nHR emails incident details to Sentry and the broker to receive a claim number.\n\nEmployees must miss 7+ days to receive Workers Comp benefits.\n\nHR tracks all incidents in the Log of Work-Related Illnesses or Injuries for annual submission to the Bureau of Labor Statistics.\n\nHR must investigate injuries thoroughly to confirm validity and prevent unnecessary liability.\n\nHiring Process\n\nHR reviews Indeed applications daily.\n\nConducts phone screenings in English or Spanish using prepared question prompts.\n\nScreenings last ~4 minutes to determine if an in-person interview is needed.\n\nIn-person interviews include a warehouse test (electric jack operation).\n\nHR evaluates applicant experience, skill, professionalism, and fitness.\n\nCompliance & Legal Requirements\n\nHR must follow labor laws and internal company policies.\n\nFMLA allows eligible employees 12 weeks of job-protected leave.\n\nAll terminations must be reported to the Department of Labor within 7 days.\n\nHR must investigate all complaints and allegations—none can be dismissed without review.\n\nConfidentiality is always required.\n\nThursday Check Distribution\n\nHR receives Operations checks on Thursday.\n\nChecks are scanned for documentation and sorted by order.\n\nBreakdown is created by Sam Cuesta.\n\nManagers distribute checks Thursday night or Friday morning.\n\nDaily Workflow\n\nHR balances structured tasks (payroll, trackers, incentive logs) with unpredictable events such as injuries, complaints, and employee requests.",
      "chunk_token_count": 497
    },
    {
      "id": "warehouse_hr_introduction_2",
      "category": "hr",
      "section_title": "Introduction",
      "keywords": [
        "organization",
        "adaptability",
        "crucial",
        "maintaining",
        "efficiency",
        "compliance"
      ],
      "content": "Organization and adaptability are crucial to maintaining efficiency and compliance.",
      "chunk_token_count": 20
    }
  ]
}