{
  "knowledge_base": "driscoll_warehouse_night_shift_loading_manual",
  "version": "1.0",
  "description": "Warehouse night_shift_loading processes and procedures",
  "source_file": "Night Shift Loading Manual.docx",
  "file_hash": "621117d06cc0d443c873b682512bae76a28b952184b7358302229e0584b8e417",
  "chunks": [
    {
      "id": "warehouse_night_shift_loading_introduction_0",
      "category": "night_shift_loading",
      "section_title": "Introduction",
      "keywords": [
        "truck",
        "loading",
        "pallets",
        "shift",
        "order",
        "during",
        "ensure",
        "route",
        "loaded",
        "loaders"
      ],
      "content": "Night Shift Loading Manual\n\nOverview:\nLoading during the PM shift begins at 4:00 PM or 5:00 PM and continues until all trucks are fully loaded, typically ending around 4:00 AM. This job plays a vital role in the efficiency and accuracy of the entire night shift operation. Loaders ensure that all products picked during the shift are correctly loaded onto the designated trucks in an organized and safe manner for timely delivery.\n\nStarting the Shift:\nLoaders start by clocking in and going to the window, where they receive their loading sheets from the clerks. The clerk will assign the next available truck door to load. Pallets for each order are placed in front of the door by the pickers. Before beginning, loaders verify the order information and ensure that all pallets correspond to the correct route.\n\nLoading Procedure:\n\nCheck the Order:\nReview each pallet’s labels to ensure the route and stop information match your assigned truck. Every pallet for a given order must be accounted for before loading begins.\n\nTruck Layout and Organization:\n\nLoad the last stops (those furthest along the route) to the nose of the truck.\n\nLoad the first stops (those earliest along the route) at the tail, closest to the door.\n\nThis ensures efficient unloading for the drivers and prevents confusion during deliveries.\n\nSafety and Stability:\n\nPallets several feet tall must be strapped down within the truck for stability.\n\nSingle-layer pallets do not require strapping.\n\nIf a pallet is not wrapped securely, rewrap it before loading to avoid shifting or damage during transport.\n\nLoading Execution:\n\nUse your jack to move pallets carefully into the truck, following the stop sequence order.\n\nBe vigilant to ensure all pallets on the sheet are loaded onto the correct truck.\n\nDo not mix routes, each truck should contain pallets only for its assigned deliveries.",
      "chunk_token_count": 448
    },
    {
      "id": "warehouse_night_shift_loading_introduction_1",
      "category": "night_shift_loading",
      "section_title": "Introduction",
      "keywords": [
        "truck",
        "company",
        "floor",
        "loading",
        "efficient",
        "pallets",
        "loaded",
        "then",
        "well",
        "efficiency"
      ],
      "content": "Efficiency and Floor Flow:\nThe pace of loading directly impacts the rest of the warehouse operation. If loaders fall behind, the floor becomes congested with pallets, making it harder for everyone to move and work efficiently. Staying on schedule keeps workflow smooth and helps the entire team stay productive.\n\nBreaks and Timing:\nEach loader receives:\n\nTwo 15-minute breaks\n\nOne 30-minute lunch break\nThese must be taken in designated areas—not on the floor or near trucks.\n\nAfter Completing a Load:\nWhen a truck is fully loaded, return the paperwork to the clerk. You will then receive the next loading assignment. Staying efficient and consistent allows the entire night shift to finish on time and supports the company’s goal of accurate and on-time deliveries.\n\nSteel toe shoes above the ankle or necessary given company policy.\n\nPerformance and Pay:\nLoaders are paid per pallet loaded, with opportunities to earn more through efficiency and productivity. However, accuracy is equally important—misloads negatively impact both company performance and individual pay. Strive to balance speed with precision.\n\nWhy Loading Matters:\n\nYou must keep everyone safe by clearing the floor and without the pallets going into the truck then deliveries cannot happen so making sure the truck is loaded safely and the weight distribution is okay then you will be successful. Following the paperwork and not misloading any pallets is important so customers can get their correct orders, and the company can be efficient in spending the money that it is, rather than extra if they must pick up a pallet and not. The driver will be efficient in unloading a truck if you are efficient in loading a truck, you doing well will help the next person do well which means the company will do well at the end of the day.",
      "chunk_token_count": 444
    }
  ]
}