{
  "knowledge_base": "driscoll_warehouse_night_shift_picking_manual",
  "version": "1.0",
  "description": "Warehouse night_shift_picking processes and procedures",
  "source_file": "Night Shift Picking Manual.docx",
  "file_hash": "b2416dc692c1a85a6c996846e6b6be819bcfb97cd1f4bade60db75727c0db3ab",
  "chunks": [
    {
      "id": "warehouse_night_shift_picking_introduction_0",
      "category": "night_shift_picking",
      "section_title": "Introduction",
      "keywords": [
        "shift",
        "night",
        "picking",
        "manual",
        "overview",
        "vital",
        "role",
        "operation",
        "job",
        "typically"
      ],
      "content": "Night Shift Picking Manual\n\nOverview\n\nPicking is a vital role in the night shift operation. The job typically begins at 4:00 PM for some workers and 5:00 PM for others, continuing until the shift is usually around 4:00 AM. Employees are paid hourly and could earn incentives and bonuses if their productivity exceeds 100%.",
      "chunk_token_count": 79
    },
    {
      "id": "warehouse_night_shift_picking_introduction_1",
      "category": "night_shift_picking",
      "section_title": "Introduction",
      "keywords": [
        "pickers",
        "their",
        "picking",
        "shift",
        "room",
        "minute",
        "labels",
        "receive",
        "pallet",
        "required"
      ],
      "content": "Picking Workflow and Tips\n\nAt the beginning of the shift, pickers clock in, put on their required clothing in the locker room, and head to the machine room to get their jack. There is a 10-minute grace period for arrival. At 4:00 or 5:00 PM, pickers report to the window where a clerk enters their employee ID and provides a list of labels. Using the Jennifer voice system, pickers receive directions to specific warehouse locations to retrieve the necessary products.\n\nMost picks are located on the first level of slots, allowing easy access by jack. Pickers must ensure that the case and label match the designated slot to avoid mispicks, as errors negatively impact both company performance and individual bonuses. When a slot is out of picking range, pickers must request assistance from a hi-lo operator.\n\nPicking success depends on productivity, speed, and accuracy. After completing a pallet, pickers deliver it to the designated door where loaders take over. They then return to the window to receive their next list of labels. Many experienced pickers keep 10–12 extra pallets nearby for efficiency. Jennifer directs pickers through slots, but proper pallet organization is essential—heavier cases must go on the bottom, and lighter ones on top to prevent damage.\n\nNavigation and planning are key to being an efficient picker. Skilled pickers quickly review their labels to form a fast and logical route based on case weight and location, minimizing unnecessary movement and pallet reorganization. This job is crucial since approximately 95,000 cases are processed nightly. The faster and more accurately pickers complete their tasks, the earlier the shift can finish.\n\nNight shift pickers receive two 15-minute breaks and one 30-minute lunch break. Eating is not allowed in the machine room or on the floor. Pickers are strictly prohibited from taking any product security cameras monitoring all areas. Safety is paramount since electric jacks are powerful machines. Awareness of surroundings and other workers is critical.\n\nThere are three temperature zones in the warehouse. Most pickers primarily work in one zone, but those in the cooler and freezer must also collect product weights, as this data determines how the company is paid for temperature-controlled items. In the dry zone, weights are not required.",
      "chunk_token_count": 580
    },
    {
      "id": "warehouse_night_shift_picking_introduction_2",
      "category": "night_shift_picking",
      "section_title": "Introduction",
      "keywords": [
        "picking",
        "company",
        "wrap",
        "pallet",
        "job",
        "happen",
        "steel",
        "toe",
        "shoes",
        "above"
      ],
      "content": "Steel toe shoes above the ankle or necessary given company policy.\n\nOnce you have finished your pick and before you go back to the window you must wrap the pallet in the saran wrap for the stability of the pallet when the truck goes into transport.\n\nWhy Picking Matters\n\nNight shift picking is a demanding but rewarding role for those who value hard work, accuracy, and efficiency. It is a job that directly contributes to the success of the entire warehouse operation. If picking does not happen, then deliveries do not happen, and customers do not get their product leading to the company not making money. Picking is an essential and tedious job that is impactful to the company.",
      "chunk_token_count": 167
    }
  ]
}