{
  "knowledge_base": "driscoll_warehouse_ops_admin_manual_(made_by_matt_fava)",
  "version": "1.0",
  "description": "Warehouse ops_admin processes and procedures",
  "source_file": "Ops Admin Manual (made by Matt Fava).docx",
  "file_hash": "702d1a0cf57fbbf7250e850bc09965b5936ce516eb9fbdd69fe2604109a86b58",
  "chunks": [
    {
      "id": "warehouse_ops_admin_introduction_0",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "report",
        "lucas",
        "ops",
        "apt",
        "daily",
        "checker",
        "batch",
        "loader",
        "errors",
        "selector"
      ],
      "content": "Ops Admin\n\nMonday:\n\nAPT Report (Friday, Sunday, Weekly)\n\nLucas Picks(Saturday Monday)\n\nVIP Check\n\nLoader Report (Friday Old &Sunday New)\n\nLoader report(weekly)\n\nDaily Ops Stats\n\nCatch weight changes\n\nDevice tracker\n\nShorts & Mispicks J & I, DSM, checker errors, daily ops\n\nLucas Batch not called in not including NY and PA\n\nLucas No PIR 3 above\n\nChecker Report\n\nMena Inventory(3:00pm)\n\nAPT Selector batch start and end time\n\nTuesday:\n\nAPT Report\n\nLucas Picks\n\nVIP Check\n\nLoader Report\n\nDaily Ops Stats\n\nCatch weight changes\n\nDevice tracker\n\nBids Credits\n\nShorts & Mispicks J & I, DSM, checker errors, daily ops\n\nLucas Batch not called in not including NY and PA\n\nLucas No PIR 3 above\n\nChecker Report\n\nAPT Selector batch start and end time\n\nWednesday:\n\nAPT Report\n\nLucas Picks\n\nVIP Check\n\nLoader Report\n\nDaily Ops Stats\n\nDevice tracker\n\nCatch weight changes\n\nSelector Progression Chart\n\nNight kpis(1:00pm)\n\nTransportation KPI(1:00pm)\n\nShorts & Mispicks J & I, DSM, checker errors, daily ops\n\nLucas Batch not called in not including NY and PA\n\nLucas No PIR 3 above\n\nChecker Report\n\nAPT Selector batch start and end time\n\nThursday:\n\nAPT Report\n\nLucas Picks\n\nVIP Check\n\nLoader Report\n\nDaily Ops Stats\n\nCatch weight changes\n\nDevice tracker\n\nDriver Overview\n\nWeekly ops performance by division\n\nShorts & Mispicks J & I, DSM, checker errors, daily ops\n\nLucas Batch not called in not including NY and PA\n\nLucas No PIR 3 above\n\nChecker Report\n\nAPT Selector batch start and end time\n\nFriday:\n\nAPT Report\n\nLucas Picks\n\nVIP Check\n\nLoader Report\n\nDaily Ops Stats\n\nCatch weight changes\n\nDevice tracker\n\nShorts & Mispicks J & I, DSM, checker errors, daily ops\n\nLucas Batch not called in not including NY and PA\n\nLucas No PIR 3 above\n\nChecker Report\n\nAPT Selector batch start and end time\n\nShort answers\n\nReprinting a live invoice: telenet, 225 printer number is 3\n\nReprinting a closed invoice: telenet 7171 I invoice number printer 3\n\nFinding older credits: 75 cust number\n\nInv Adjustments 512item number T x for all A for adjustments\n\nFind errors DUG71\n\nRoutes per warehouse\n\nWayne IDs\n\n02-98\n\nA-F\n\nH-M\n\nQ\n\nT-U\n\nPA IDs\n\nP\n\nR\n\nS\n\nN\n\nO\n\nNY IDs\n\nG\n\nW\n\nY\n\nX\n\nZ\n\n01 - is for pick ups/will calls for all divisions",
      "chunk_token_count": 461
    },
    {
      "id": "warehouse_ops_admin_introduction_1",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "item",
        "route",
        "ops",
        "inventory",
        "slotted",
        "fwd",
        "slot",
        "response",
        "errors",
        "email"
      ],
      "content": "78 is a holding pattern for unrouted orders. All delivery orders are route 78 until they are assigned a route. Routing checks route 78 at the end of routing nightly to confirm there is nothing still in route 78 that needs to be assigned, because if so it will not be picked/delivered\n\n99 is a pick and stage route ID used in Wayne\n\n276 live mispicks report\n\nOPS error\n\nWeight call in issues\n\nIf there are issues, email Kudjoe Daniel White and Clauder\n\nMispick\n\nFWD message to Inventory Control CC ops error\n\nMsg:\n\nCan you check the slot for item #XXXXXXX\n\nWe sent Y\n\nExample\n\nTo get the item number and description log into Telenet 51type in the item number, copy and paste the description into the email\n\nIf the Item is slotted correctly\n\nForward the response from inventory to the sales rep CC ops errors\n\nMsg:\n\nProduct slotted correctly. This was a mispick and will be addressed.\n\nIf item is slotted correctly but slot is mixed, cc Samantha cuesta so the selector is not penalized for a mispick that’s not his fault\n\nIn telenet 27364 put in the date, route, and item\n\nCopy the picker and item info for the next email\n\nThen forward the response from inventory to the corresponding night manager (dry, freezer, or cooler) CC Ops errors, phillip rodriguez, kudjoe larbi, and Daniel white\n\nMSG:\n\nWe picked x from slot a instead of y from slot b\n\nPaste the telenet info for the picker and item\n\nExample:\n\nIf the item is slotted incorrectly\n\nFWD the response from inventory to the sales rep CC ops errors\n\nItems slotted incorrectly, it has since been fixed.\n\nDamage/Quality/Expiration\n\nFWD Item to inventory control CC ops errors & produce (if it is a produce item)\n\nCustomer received (issue) products, can you please check item #(item number) for (issue)\n\nFWD their response to the sales associate with a brief summary of what happened.\n\nShorts\n\nUsually you can not follow up on shorts for a couple days after the delivery date as the invoices, and driver return forms need to be filed and uploaded to the system.",
      "chunk_token_count": 476
    },
    {
      "id": "warehouse_ops_admin_introduction_2",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "report",
        "item",
        "number",
        "apt",
        "invoice",
        "check",
        "reports",
        "off",
        "first",
        "use"
      ],
      "content": "First check Lucas/Lucas pick report to see if the item was confirmed picked. Use item & order number to confirm.\n\nNext check the driver return reports in V:\\Route Return sheets use the date and route number to find the form. If the email does not include the route number, use telecom to look up the route number with the order/invoice number 211order/invoice number example on next page(A). Last check the invoice to see if the item was checked off and signed for use the archive picker with the invoice number to see the invoice find the item in question and whether it was marked off. A small check usually denotes the item was checked off.\n\nEmail: you can reply to the sales rep letting them know if the item was confirmed picked in lucas, whether it was on the driver return report, and if it was checked off on the invoice. As well as screenshots of all 3 with the item in question highlighted.\n\nEX:\n\nAPT report\n\nDone Daily for the day before also done weekly for Sun-FRI of the week before\n\nOn Monday run for Friday, Sunday, and the week\n\nYou should have 6 daily and 1 weekly report per week\n\nAPT by agent folder on desktop\n\nLog in\n\nWayne\n\nTop left of screen Reports  reports menu\n\nDepartment Reports\n\nDepartment – Associate Summary\n\nSort by Percent Performance\n\nDate range: date you want to run done for the day before Ex: on the 27th you would run the 26th\n\nCosts from: 4.  Payroll – Actual\n\nTime format: 2. Hours\n\nGo to start report\n\nTo export report\n\nFormat:MS Excel 97-2000(data only)         Check off maintain column aligment\n\nSave the file on your desktop it will be deleted after it is used.\n\nHighlight column A (only numbers ignore the first two rows and last 2 rows)\n\nClick on the triangle and convert to numbers\n\nPaste these items as values into the template APT report located here(O:\\Ops\\Night reports\\APT Daily and Weekly\\2025) into the first 2 columns\n\nCopy col C to P ignoring the first and last 2 rows\n\nPaste into apt report starting Col D\n\nCopy row with dept #01 total from the report you ran into bottom of apt report\n\nName Tab in APT report with Weekday, Month Date\n\nSave As",
      "chunk_token_count": 499
    },
    {
      "id": "warehouse_ops_admin_introduction_3",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "lucas",
        "right",
        "report",
        "date",
        "below",
        "folder",
        "monday",
        "click",
        "col",
        "apt"
      ],
      "content": "MMDDYY APT Report in the correct month folder\n\nEmail to Night ops\n\nCC Samantha Cuesta, Jarred Ferrer Phillip Rodriguez, Alejandro Texca, Kudjoe Larbi, Clauder Jimenez\n\nSubject: APT Report MMDDYY\n\nMsg\n\nPlease see attached for the APT report for Weekday, Date\n\nLucas Picks\n\nDaily\n\nOn Monday do for Saturday and Monday dates\n\nIf you load Lucas and get a Microsoft silverlite notification go to the browser settings and add lucas to the internet explorer mode pages\n\nLayout and saved files are in O:\\Ops\\Night reports\\Lucas saved files are in folder 2025(or whatever year it is)\n\nOpen lucas go to picklines\n\nMake sure all is unfiltered hit the unfilter button\n\nClick on Ship date filter then custom your start date will be the day before and your end date will be the day of the report being ran.\n\nOn Monday run for Saturday and Monday\n\nThe example below is being run for Tuesday, January 28, 2025\n\nExport excel\n\nButton in bottom right corner\n\nRecords from 1 to X round total records up to nearest 1000, number of records can be found below the export panel\n\nCopy all information below the header line into the layout folder use option on the right paste match destination formatting\n\nHighlight all information in col G below the header line and shift to the right\n\nHit insert, Shift cells right\n\nIn G2 use the concat formula to combine D2 E2 and F2 with spaces between.\n\n=CONCAT(D2,\" \",E2,\" \",F2)\n\nDrag formula down to bottom of col or double tap the square in the bottom right corner\n\nCopy all those cells and paste as values, clipboard with 123\n\nHide Col G, click on the G col right click and hit hide\n\nGo to Column S Highlight all below header line\n\nRight click go to format cells under category choose number and make sure there are 0 decimal places\n\nSave As follow formatting of the previous Date in folder labeled 2025(or whatever year it is)\n\nEmail to Transportation\n\nCC: Kathy taormina, Samantha Cuesta, Jarred Ferrer, Alejandro Texca, Andrea Cuesta, Andrew Herasimtschuk, Claduer Jimenez\n\nSubject Lucas Picks “dates”\n\nMsg:\n\nGood morning,\n\nPlease see attached for the lucas picks report for\n\nWeekday, Month day year\n\nVIP Report",
      "chunk_token_count": 499
    },
    {
      "id": "warehouse_ops_admin_introduction_4",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "vip",
        "customer",
        "report",
        "special",
        "code",
        "email",
        "alert",
        "col",
        "order",
        "date"
      ],
      "content": "Start around 5pmish\n\nTelecom 3021 use tomorrows date, these reports are emailed to you\n\nVIP Alert\n\nVIP Orders\n\nOpen the VIP + Audits template in the corresponding year in O:\\Ops\\Audits\n\nSave with tomorrows date, change the date in the report\n\nVIP Alert copy and paste into report in 1 column paste special, text\n\nHover the first col go to data text to columns, fixed with take the 2nd col and put it in col G the other col in col H\n\nExtract the Customer code and order code from that info type in the next two columns the 2nd code is the customer code the 1st is the order code.\n\nCopy those two columns over to column G&H sort g&h az\n\nSelect A D G H use conditional formatting to duplicate. Delete any set of 2 codes that are not highlighted.\n\nIf a customer has multiple non duplicate orders add rows to the report and add those orders in copy all information\n\nDelete any of the special routes with no instructions.\n\nFor Jarreds sections open telenet 51 enter the Fry code. Left arrow down arrow, add the customer #, name, and order number\n\nCAR\n\nYou will receive CAR emails throughout the day from Ashley Rodriguez put the customer number name reason and order # to the report.\n\nIt will be the same process for new customer alerts\n\nSpecial cases can be added to the new customer alert section, add the customer # name, order number and notes, the reason will be special request Highlight and special requests.\n\nThere is a VIP Audits accounts email template in the folder O:\\Ops\\Audits double click this to open. Copy all the information from the audit report and paste it into the email. Save the VIP report as a PDF.  Attach the PDF, VIP Alerts, and VIP Orders files to the email.\n\nAttach all the Car, New customer, and Special alert emails to this email. If there are special requests draw attention to it in the email.\n\nEX:\n\nVIP CT Report\n\nAt 3:00pm run the VIP report route starts with an I\n\nTelecom 3021 use tomorrows date, these reports are emailed to you\n\nEmail the VIP Alert file to Night ops, Shaun smith, Sara Kenyon, Kudjoe, Daniel White, Phillip Rodriguez\n\nVIP CHECK",
      "chunk_token_count": 495
    },
    {
      "id": "warehouse_ops_admin_introduction_5",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "col",
        "report",
        "loading",
        "into",
        "date",
        "paste",
        "vip",
        "checking",
        "make",
        "sure"
      ],
      "content": "After completing the APT and Lucas reports\n\nYou should have a pile of VIP sheets on your desk in the morning\n\nYou will mainly be checking for shorts and weighted items, when you see a weighted item you have to add all the individual weights together to make sure they add up to what’s in telnet and what’s on the VIP Sheet\n\nFor shorts you are just checking to make sure the item was adjusted in telnet the same as it was on the VIP sheet.\n\nOpen Telnet 23\n\nOrder number click left until you get this message at the bottom, ? enter type in the item number\n\nOnce you go through all the sheets, scan all the sheets into your computer. Save them with todays date Ex 02-03-2025\n\nYou save them in the VIP + Audits folder under the scans folder in the correct month\n\nLoader Report\n\nO:\\Ops Management\\Maintenance\\Night\\Loaders\\Loader Productivity\\Tracking Reports\n\nWeekly loading Reports  2025  loading report week template\n\nSave for the correct week, after saving rename each tab between the days of the week with the days of the week\n\nLoading report should be emailed from Night Clerk\n\nLoading report “date”.xls\n\nOpen this report, go to the bottom cut and paste col B-E the extra notes at the bottom to the right of the page in col AD-AG\n\nMake sure every cel in col AB has the countif formula\n\nCopy and paste all the information from the loading report into the into the weekly loading report using paste values and formatting\n\nFor Fridays select all under the header in COL G, add two columns, and you will not need a checking sheet for the date tab\n\nSelect all the cells under Col V header LOT#, delete all and shift cells to the left\n\nIt should look like this at the top instead of blank cells\n\nCopy all the route numbers from Col A and paste it into the date tab col A as values only\n\nGet the pallet by summary route for the date, copy all and paste them into col G&H\n\nThe rest of the columns should automatically fill out\n\nMake sure Cols B, C, D, E have the formulas filled out\n\nGet the checking sheet from Night clerk (day before)",
      "chunk_token_count": 489
    },
    {
      "id": "warehouse_ops_admin_introduction_6",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "col",
        "into",
        "sheet",
        "copy",
        "them",
        "loader",
        "paste",
        "bonus",
        "date",
        "tab"
      ],
      "content": "Put a filter on Row 7, filter name without blanks\n\nCopy all routes from col A and paste them into the date tab in the loading report weekly Col O\n\nHighlight col A and O and use conditional formatting duplicate cells\n\nSort col A by highlight color red up top\n\nAny rows that have Col A highlighted go to route E and if the value is 0 change it to a 1 and change the text color to red\n\nClick on the pivot table then go to the pivot table analyze and change data source, change it to col A-E, then filter and include all the numbers minus blanks, 0, and none\n\nLoader bonus tracker\n\nO:\\Ops Management\\Maintenance\\Night\\Loaders\\Loader Productivity\\Tracking Reports\\Loader Bonus\\2025\n\nUse template to create this weeks report save for the end of this week\n\nCopy id from the first col of the pivot table past into loader bonus sheet, employee should fill out\n\nCopy routes pallets and specials and paste into loader bonus sheet\n\nTake the IDs from the pivot table on the date tab and paste them into sheet 1 on the loader bonus sheet Put the day of the week next to it\n\nFind out what gets attached to the email\n\nSelector Progression Chart\n\nThis report will always be for the week that ended before\n\nAfter sending will be printed out give to phillip rodriguez or kudjoe you will get them back signed go through and scan them and put them into the folder of the day they are in\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Performance Productivity\\Night Warehouse\n\nOpen and save a new copy of each report in the year and month, with the new end of week\n\nOpen the errors file delete all info inside save as errors WE last weeks date\n\nO:\\Ops Management\\Maintenance\\Night\\Selector Incentive\\DF SI\\2025\n\nGo to the sheet that says Final\n\nGo to the Weekly totals tab, copy COL A,B,C,D( ID, employee name, temp zone, Hire date) and paste them into the Errors sheet\n\nCopy Col I,J,K(Shorts, mispicks, damages) from weekly totals tab and paste into errors sheet",
      "chunk_token_count": 470
    },
    {
      "id": "warehouse_ops_admin_introduction_7",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "sheet",
        "col",
        "progression",
        "tab",
        "make",
        "ops",
        "copy",
        "delete",
        "done",
        "selector"
      ],
      "content": "Open weekly APT report, copy over ID, employee name, date of hire, temp zone, on standard hours, earned hours, and cases to the Progression APT sheet\n\nOn the Progression use a VLOOKUP for the shorts, mispicks, damages and temp zone\n\nHide col E through J, make sure COL D matches COL K if you change it make the text red\n\nDelete Rows where it says, Loader, Replen, or mentor\n\nThis sheet is done you can delete COL K and make sure all values are numbers and not formulas\n\nSelector Progression Sheet\n\nIf you have not already done save a new copy for this week\n\nAs you go through tab by tab copy the formulas over to the next week and input the info from the Progression sheet.\n\nWhen you are done with a selector highlight the name and go to the next on\n\nIf someone is not on the progression chart but is on the selector progression chat hide the tab\n\nIf someone is not on the selector progression chart but on the progression sheet unhide the tab\n\nIf a trainee is done with their entire sheet and there is no room to input more data, make a copy of the intermediate sheet next to their name input their personal info at the top delete the old tab and continue as normal. If there is a new hire, make a new tab using the Trainee tab.\n\nIf an intermediate or advanced tab is full and you need to add more data for this week, delete all info inside and continue as normal\n\nWhenever deleting info make sure the first col in each chart has the formulas in it\n\nDaily ops stats\n\nO:\\Ops Management\\Maintenance\\Reports\\KPIs\\2025\n\nOrange boxes are from the dispatch sheet\n\nO:\\Ops Management\\Maintenance\\Driver\\DF DI\\Dispatch Sheets\\Dispatch Sheets 2025\n\nRTs col\n\nHighlight all RTs in col A stop at transfer use count for total, subtract Double RTS and BHS from ops stats sheet\n\nBHs = BHS in ops stats\n\ntransfers\n\nFilter route descriptions to include descriptions that include transfer\n\nClear filter\n\nStraight trucks: Select all in Col H before transfers subtract Double STR in col B ops stats",
      "chunk_token_count": 472
    },
    {
      "id": "warehouse_ops_admin_introduction_8",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "col",
        "boxes",
        "report",
        "select",
        "total",
        "count",
        "date",
        "driver",
        "sheet",
        "pto"
      ],
      "content": "TT Filter col H by numbers that start with 88,99, or include 5641, 2651,2654, count these and subtract the duplicates and the double TT\n\nDriver helper: Filter Col without blanks select all count\n\nDriver training: go down to the disability section of the dispatch sheet select all in col X tht have training in it\n\nDriver PTO: select anything with vacation or personal time PTO in col X\n\nSame for Call out and NCNS\n\nFor extra drivers anything that includes assistant, extra, inhouse\n\nDone with the dispatch sheet\n\nLight grey blue boxes\n\nOpen the APT report for the day before so for the 6th you open the APT report for the 5th\n\nAt the bottom of the APT report get total cases from col P and PM% from col M\n\nGreen Boxes\n\nUse Dug 14 to get inbound cases and pallets for the day warehouse 01\n\nPurple Boxes\n\nSent over from Frank Bedon Day warehouse attendance report\n\nUse the box in the middle towards the bottom\n\nUse Total here today for AM OPS headcount\n\nVacation + personal for AM PTO\n\nNCNS for AM NCNS\n\nLeft Early for AM Left early\n\nTerminate/Quit for AM terminate/quit\n\nYellow boxes\n\nEmail Nightshift Recap from Daniel White/Kudjoe\n\nUse Delivery Date on sheet to determine what row to put it in\n\nStops for orders Col H\n\nBatches for Col I\n\nSelects head count, total selectors col Z\n\nPM Trainers, total trainers\n\nPTO in scheduled time off, Count\n\nPM C/O, NCNS, S/H in sheet\n\nDark Blue boxes\n\nO:\\Ops Management\\Maintenance\\Driver\\DF DI\\Incentive Changes\\2025\n\nSelect the report for the Week end that your date falls into, filter by the date of the report look for red text if it says accident its for accident, any customer complaint counts for injuries\n\nGrey boxes\n\nFinal Reship log email\n\nGet the reships & voids here\n\nWhite boxes\n\nFuel\n\nPortal.restalloil.com, ULSD clear total\n\nMilage\n\nIntelishift\n\nDate & reports, on-demand reports, state mileage, select all trucks, select for the date go to the last page for total\n\nEmail template in folder: Daily Ops stats\n\nFor Saturdays a couple things change\n\nThe yellow boxes open the APT report highlight all the selector names for selector head count 0 out the rest",
      "chunk_token_count": 491
    },
    {
      "id": "warehouse_ops_admin_introduction_9",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "report",
        "use",
        "ops",
        "weekly",
        "total",
        "night",
        "reports",
        "kpis",
        "management",
        "maintenance"
      ],
      "content": "Orders go to lucas picks report, highlight all Col create a pivot table, the recommended just hit okay. Order put in rows highlight all for total orders\n\nBatches uncheck orders check assignments highlight all to count\n\nNight KPIs\n\nO:\\Ops Management\\Maintenance\\Reports\\KPIs\n\nUse the Night ops KPIs report\n\nAPT Report, for the day before\n\nFor each section add together pick and school numbers to get the total\n\nGo to shorts & mispicks report\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Weekly\n\nGo to the week that the date you are doing is in\n\nIn the wayne by temp zone tab go to the pivot table uncheck picker names, click on date then ungroup\n\nThe table should look like this\n\nIn the recap Q and W tab you will put the hours that come across from the two emails together and put them in the correct week col\n\nYour Report Night Shift Driscoll KPI is ready\n\nYour Report Future Night KPI is ready\n\nFor total routes use the loading report highlight col A for the route count for that day\n\nO:\\Ops Management\\Maintenance\\Night\\Loaders\\Loader Productivity\\Tracking Reports\\Weekly Loading Report\n\nUse the loader bonus report to get the # of loaders per week and loading errors use the weekly totals tab\n\nUse the weekly APT report to get APT % use performance for the %\n\nTransportation KPIs\n\nO:\\Ops Management\\Maintenance\\Reports\\KPIs\n\nWeekly routing numbers report will come across from Andrew V,\n\nYou get the stops cases and reships from this report use the weekly totals\n\nShorts & mispicks report for short, short/found later, and damages\n\nDriver by supervisor tab, unselect driver name\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Weekly\\2025\\1. January 2025\n\nDriver hours\n\nDriver KPI email\n\nNight shift\n\nUse inteleshift for the week total miles\n\nData and reports  state mileage, select all, select the week (Sun-Sat) you are doing go to last page for total check if its total or adding certain things states together\n\nDevice Tracker\n\nO:\\Ops\\Device Tracker\n\nStart shift tab\n\nFormat and unprotect the Sheet, Password is 12345\n\nSort Assigned number smallest to largest\n\nUpdate any employee information",
      "chunk_token_count": 500
    },
    {
      "id": "warehouse_ops_admin_introduction_10",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "sheet",
        "number",
        "shorts",
        "tab",
        "ops",
        "use",
        "device",
        "management",
        "maintenance",
        "mispicks"
      ],
      "content": "To get the information go to telenet 3020 use the ID to get the employees name so you can add it to the employee listing tab\n\nHighlight Cols C&D format check for duplicate values\n\nEnd shift tab\n\nUnprotect sheet\n\nSort assigned number smallest to largest\n\nCheck Col A for duplicates\n\nCheck total scanned on the start and end shift tabs\n\nFormat protect both tabs on the sheet\n\nDevice Sticker Replacement\n\nO:\\Ops\\Device Tracker\n\nThe Device Tracker TEMPLATE sheet has a hidden tab called devices\n\nUnhide the sheet\n\nWhen you need to put new stickers on the phones.\n\nYou can put either the number, barcode, or both stickers on the phone dependent on whats needed\n\nOn the phone open the Lucas Move app, hit the green button in the top right corner, make sure this number matches the number on the sheet if it does you can go ahead and print out your sticker\n\nFor the barcode on the label printer, create label FNgo to the bottom hit barcode then type the number in and print it out,\n\nFor the device number just go to create label and type the phone number in\n\nDriver overview\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Performance Productivity\\Drivers\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Weekly\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Performance Productivity\\Drivers\\2025\\Errors\n\nIn the shorts and mispcisk file use the wayne driver  error rate tab\n\nCopy ID RT Employee name, from shorts and mispicks sheet, paste into error sheet\n\nCopy hours damage, shorts, shorts found later, & total paste into error sheet\n\nO:\\Ops Management\\Maintenance\\Driver\\DF DI\\Incentive\\2025 incentive breakdown sheet use total weekly data tab\n\nUse a vlookup using RT as the lookup ID\n\nRT over for reships violations and complaints\n\nReship 89 violations 96 complaints 103\n\nSheet 2 has all the col numbers for the vlookup\n\nFor the overview copy the ID RT and employee name over to the overview along with all the other info needed from the errors sheet\n\nMake sure all the formulas are done for each row all the way to the bottom\n\nDone with the error sheet\n\nFor the Daily data tab",
      "chunk_token_count": 499
    },
    {
      "id": "warehouse_ops_admin_introduction_11",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "item",
        "customer",
        "number",
        "hit",
        "type",
        "report",
        "credit",
        "send",
        "sales",
        "invoice"
      ],
      "content": "Copy & paste ID RT Employee name into daily data tab\n\nDFDI Dispatch sheets\n\nO:\\Ops Management\\Maintenance\\Driver\\DF DI\\Dispatch Sheets\n\nWeek ending sheet\n\nVlookup RT as the lookup ID, Start at Col B up to Col V on Dispatch sheet\n\nCases:19 Dock:18 Miles:21\n\nReplace all N/A with 0\n\nOn overview and daily data use email template\n\nDriver pickup credits\n\nEmail from Jhanfranco Bedon “date” customer pick up report\n\nRed: there was no pick up no credit issued\n\nYellow: quantity is different use the # of cases on the report\n\nBlue: picked up without pickup slip, send email to the sales person asking for them to submit a credit for the item\n\nSubject: “customer number” driver pick up credit\n\nMSG:\n\nGood afternoon,\n\nCan you please submit a credit for the attached invoice the item was picked up without a pickup form\n\nThank you,\n\nTo check sales person in telenet use 31 customer number under sales person\n\nCredits no invoice:\n\nCatch weight updates\n\nJames will send out a catch weight report in the mornings\n\nThis report shows discrepancies, update the weights in telenet, to get exact weights on multiple case items go into Lucas for the day find the item on the order click on it and hit details at the top this should give you all the separate weights per case.\n\nAfter these are updated print the new updated invoice and send it to the sales rep so they can forward it onto the customer.\n\np\n\nGood morning,\n\nThe order below was adjusted according to the weights called into Lucas Picks, please send the updated invoice to the customer\n\nBlue bins\n\nGo to Lucas picks, Warehouse, products type in the product number, click on the item line and hit edit then put the instructions in the proper lines as seen below\n\nMake sure to pack this product in a blue bin with dry ice.\n\nFragile items\n\nIn Telnet go to 51 type in the item number go to page 3, type 3 hit enter, scroll down to fragile(Y/N) type in Y and hit enter.\n\nGo to Lucas picks, Warehouse, products type in the product number, click on the item line and hit edit then put the instructions in the proper lines as seen below\n\nWeekly Ops Performance by Division",
      "chunk_token_count": 498
    },
    {
      "id": "warehouse_ops_admin_introduction_12",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "use",
        "report",
        "get",
        "shorts",
        "total",
        "week",
        "errors",
        "short",
        "filter",
        "reason"
      ],
      "content": "O:\\Ops Management\\Maintenance\\Reports\\KPIs\n\nUse DUG14 to get the inbound cases for all 3 divisions use sum for a total for the week\n\nUse DUG 16 to get the outbound cases and routes for all 3 divisions use sum for a total for the week\n\nO:\\Ops Management\\Maintenance\\Reports\\Shorts and Mispicks\\Weekly\n\nGo to shorts and mispicks report for this week, use AMS errors, PA errors, and wayne errors to get short, shorts found later, mispicks, and damages for all 3 divisions. Use filter to filter down between the 4 reasons. Copy the qty short col paste at the bottom and use the sum function to get the total errors for that reason.\n\nUse intellishift for the miles for NY and NJ\n\nData and reports, state milage\n\nUse generate report by branch\n\nRun once for each branch, use the date for SUN-SAT of the week you are running, go to the last page to get the total miles.\n\nInstructions for PA miles to be added later\n\nMisaligned Invoice\n\nCheck other invoices from the same customer to see if this was a repeat issue or was caused by another issue with a different invoice or the printer being misaligned.\n\nIf this seems to be a 1 time thing reprint and send the invoice.\n\nTwo main reasons causing invoices to be misaligned\n\nCustomer file not being filled out properly, go to 37 use customer number to look it up and 01 for the second input.\n\nIf everything on that page looks okay and it is not an issue with an item on that or another invoice send the info to programming with a couple examples of invoices asking them to look into it.\n\nDo the same thing if it looks like an item that is the issue\n\nCredits Bids/Cumulative credits\n\nDUG71VDT\n\nX on the reasons menu\n\nShorts by Reason report\n\nFilter the top row, filter COL Q by 03/MW/M8\n\nOpen Credits-CC file delete the last date on the report\n\nOn the shorts by reason report deleted dates up until the date deleted on the other report.\n\nRemove columns QTY short, reason code, RT Group description, Pickeremployee, buyerbuyer short, extended costorder number\n\nH, J, L-P, S-Z, AB-AF, AH-AJ",
      "chunk_token_count": 485
    },
    {
      "id": "warehouse_ops_admin_introduction_13",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "right",
        "use",
        "shorts",
        "mispicks",
        "lucas",
        "report",
        "formula",
        "below",
        "letter",
        "email"
      ],
      "content": "Paste all in info over to the other sheet, email to chris caselnova biddept@driscollfoods.com\n\nSales groups:\n\nPandel: Pandelgroup@driscollfoods, Bill Kenney SR & JR, Mandy, Chris Pandel, Sandy Budhu, Stuart Lews, Alma Soto\n\nH & H Camps: Nancy Cook, Grace Delli Santi\n\nLucas PIR Report\n\nFilter Lucas picks col T by CG FS and DO add a column to the right of COL T and use formula below to pull out slot levels. Have 2 sheets one with levels 1,2,3  and the other with 0,4,5,6,7,8,9\n\nLevel pull out formula\n\n=IF(IF(ISERR(RIGHT(T9708,1)*1),\"letter\",\"number\")=\"letter\",MID(T9708&\" \",7,1),RIGHT(T9708,1))\n\nPivot table\n\nUse this to get the\n\nNumber of skus\n\nPer level, highlight all of\n\nQty ordered and look at\n\nThe sum in the bottom\n\nRight for the total cases\n\nLucas 3 and above report\n\nSimilarly to the Lucas PIR Report we are testing cases ordered  first add a column next to the slot column, use this formula\n\n=IF(OR(ISNUMBER(SEARCH(\"CG\", T2)), ISNUMBER(SEARCH(\"FS\", T2)), ISNUMBER(SEARCH(\"DO\", T2))), \"Remove\", \"Keep\")\n\nFilter to only have “Keep”\n\nUse the Left function in excel to pll the first lett in the location cell filter3 tabs based on C for cooler, F for freezer, D for dry\n\nThen use the same formula to pull the level\n\n=IF(IF(ISERR(RIGHT(T9708,1)*1),\"letter\",\"number\")=\"letter\",MID(T9708&\" \",7,1),RIGHT(T9708,1))\n\nAfter this uncheck 1 and 2\n\nShorts & Mispicks Route J & I\n\nWhen the shorts & mispicks report comes across filter the routes by those starting with J & I\n\nSave and send to kudjoe, danny, shaun and CC sara\n\nAny issues labeled driver send to Victor, Mike, Delareese, and CC sara\n\nIn this email copy and paste the error information in the body of the email.\n\nGood afternoon,\n\nPlease see below for the shorts & mispicks for routes J & I for 8/25/25\n\nGood afternoon,\n\nPlease see below for the shorts & mispicks for routes J & I for 8/25/25 noted driver\n\nShorts and mispicks by DSM\n\nWhen the shorts and mispicks report comes across highlight all columns and create a pivot table. Use the fields screenshot below to make the pivot table. Send this to Sara\n\nLucas Batches not called in",
      "chunk_token_count": 493
    },
    {
      "id": "warehouse_ops_admin_introduction_14",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "lucas",
        "picks",
        "called",
        "batches",
        "report",
        "remove",
        "col",
        "routes",
        "temp",
        "zone"
      ],
      "content": "Filter col Q of the Lucas report by blanks, For JITMEAT and JITSEA remove all PA and NY routes (below) remove JITOFFICE and JIT\n\nPA IDs\n\nP\n\nR\n\nS\n\nN\n\nO\n\nNY IDs\n\nG\n\nW\n\nY\n\nX\n\nZ\n\nCopy and paste all assignments by temp zone into a new tab use =count(unique,{col of data}) for the total batches not called in\n\nFind a way to get all the unique batch values look at those values for every line make sure all items are not called in\n\nRun the Lucas report for empty picked by, remove all rows with a number greater than 0 in quantity scratched and short. Filter by temp zone, copy all assignments use data tab in excel to remove all duplicated. Open the lucas report from the moring, look up all batches individually. Any assignments that have other items called in remove them from the list. Any that don’t have any items called in were not called in the batches were not called in\n\nGood afternoon,\n\nPlease see attached for the Lucas picks reports filtered to show batches not called in. There were 154 Dry, 248 cooler, and 79 Freezer batches not called in. All batches should be called into Lucas even if a Jennifer device is not being used to select the batch.\n\nChecker report\n\nCannot paste these formulas you have to rewrite them\n\nFor routes with number of pallets listed\n\n=SUM(SUMIFS('Lucas Picks'!I82:I36377,'Lucas Picks'!M82:M36377,Sheet2!A81,'Lucas Picks'!N82:N36377,TEXTSPLIT(B81,\",\")))\n\nFor routes with Full written in\n\n=SUMIF('Lucas Picks'!M38:M36849,Sheet6!A121,'Lucas Picks'!I38:I36849)\n\nAfter separating by temp zone in the checker sheet, use these formulas based on Temp zone\n\n=SUMIFS('Lucas Picks'!I2:I28545,'Lucas Picks'!M2:M28545,Sheet1!A4,'Lucas Picks'!P2:P28545,\"Refer\")\n\n=SUMIFS('Lucas Picks'!I27:I28570,'Lucas Picks'!M27:M28570,Sheet1!A29,'Lucas Picks'!P27:P28570,\"Dry\")\n\n=SUMIFS('Lucas Picks'!I46:I28589,'Lucas Picks'!M46:M28589,Sheet1!A48,'Lucas Picks'!P46:P28589,\"Freezer\")\n\nM col is routes, I is qty picked, N is stops sheet2!A# is the cell in col A for this row\n\nYou will need the checking sheet, Pallet summary sheet and Lucas Pick from the date you are running this report for.",
      "chunk_token_count": 499
    },
    {
      "id": "warehouse_ops_admin_introduction_15",
      "category": "ops_admin",
      "section_title": "Introduction",
      "keywords": [
        "column",
        "route",
        "names",
        "checker",
        "copy",
        "pivot",
        "table",
        "into",
        "numbers",
        "report"
      ],
      "content": "On the checking sheet filter so that the first checker name column has no blank cells, add another column after use a vlookup using the route as the comparison to the pallet summary sheet to get the total orders for that route.\n\nignore\n\nOpen Lucas, filter only by Full Routes, copy route to work type, delete stop column highlight all of the pallet column delete duplicate data highlight all, pivot table\n\nCopy all full routes two extra times one for each zone, copy checkers into sections below, paste over the amount of pallets per temp zone\n\n=LEN(D8)-LEN(SUBSTITUTE(D8,\",\",\"\"))+1 count non full cells\n\nFor the routes with numbers i.e 1,7  5  1,2,3. Count the number of orders the previous example would be 2 1 3 and write them in that new column.\n\nNext look for any with split checkers on the route\n\nIn this example ernest would get 6 and freddy would get 5\n\nCreate a pivot table data source should look something like this, make sure to include the selectors names. Once the pivot table is created it should have only the checkers name and the number of orders\n\nAdd these numbers to the Checker report.\n\nOpen the Lucas picks report copy the route column and vip check column into a second tab in the Lucas picks report. Now use the two formulas at the top of this section if the column as numbers of pallets listed use the first formula if it says full use the second formula. Using a vlookup with route as the comparison point get the selector names next to the case numbers.\n\nNow make a pivot table with the names and cases columns, and put these numbers into the checker report\n\nAfter each day copy all the checker names and paste them into the sheet titled “Checker” along with the day of the week. On Friday take all of those names refresh the pivot table with the one week of names paste those into the weekly tab\n\nEmail\n\nNight selectors batch times\n\nRoute J & I errors\n\nRuns shorts by reason report, filter for routes J & I filter out sales errors",
      "chunk_token_count": 475
    }
  ]
}